Predicting survival from titanic crash

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
ints = df.drop('Survived',axis='columns')
target = df.Survived

In [6]:
dummies = pd.get_dummies(ints.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [9]:
ints = pd.concat([ints,dummies],axis='columns')
ints.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [10]:
ints.drop(['Sex','male'],axis='columns',inplace=True)
ints.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [12]:
ints.columns[ints.isna().any()]

Index(['Age'], dtype='object')

In [15]:
ints.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [38]:
ints.Age = ints.Age.fillna(ints.Age.mean())
ints.head(9)

   Pclass        Age     Fare  female
0       3  22.000000   7.2500       0
1       1  38.000000  71.2833       1
2       3  26.000000   7.9250       1
3       1  35.000000  53.1000       1
4       3  35.000000   8.0500       0
5       3  29.699118   8.4583       0
6       1  54.000000  51.8625       0
7       3   2.000000  21.0750       0
8       3  27.000000  11.1333       1

In [39]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(ints,target,test_size=0.25)

In [40]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [41]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [42]:
model.score(X_test,y_test)

0.7623318385650224

In [43]:
X_test[0:10]

     Pclass        Age     Fare  female
194       1  44.000000  27.7208       1
576       2  34.000000  13.0000       1
530       2   2.000000  26.0000       1
73        3  26.000000  14.4542       0
739       3  29.699118   7.8958       0
785       3  25.000000   7.2500       0
706       2  45.000000  13.5000       1
663       3  36.000000   7.4958       0
155       1  51.000000  61.3792       0
486       1  35.000000  90.0000       1

In [44]:
y_test[0:10]

194    1
576    1
530    1
73     0
739    0
785    0
706    1
663    0
155    0
486    1
Name: Survived, dtype: int64

In [45]:
model.predict(X_test[0:10])

array([1, 1, 1, 0, 0, 0, 1, 0, 0, 1], dtype=int64)

In [46]:
model.predict_proba(X_test[:10])

array([[0.09095816, 0.90904184],
       [0.27568417, 0.72431583],
       [0.14588651, 0.85411349],
       [0.97056264, 0.02943736],
       [0.97075226, 0.02924774],
       [0.96878016, 0.03121984],
       [0.27375971, 0.72624029],
       [0.9718055 , 0.0281945 ],
       [0.58434928, 0.41565072],
       [0.00544944, 0.99455056]])

In [47]:
from sklearn.model_selection import cross_val_score
scores=cross_val_score(GaussianNB(),X_train, y_train, cv=5)
np.average(scores)

0.7753899674559533